[
{ "name": "A friend of mine cooks my making up a recipe and adding a German white wine. It’s an add hock approach to cooking."},
{ "name": "The recipe said “chill in the fridge for twenty minutes”. There’s no way I’ll fit in my fridge."},
{ "name": "A friend’s recipe business “Cooking with Spices” has not been successful. His bank have called in the bay leafs."},
{ "name": "My local fajita restaurant makes great food, but they won’t share the recipe with me. They keep it under wraps."},
{ "name": "I’ve got a series of soup recipes. Do you want the detailed pages, or just the condensed version?"},
{ "name": "Tried to follow a recipe, it said for a bigger portion just double everything, but my oven doesn’t go up to 600 degrees."},
{ "name": "Most recipes in French language cook books only require a single egg. One egg is an oeuf."},
{ "name": " saw a new recipe book about cooking with herbs. It’s about Thyme."},
{ "name": "Following a recipe, says I need: apples, five cubed. 125 sounds like a lot of apples for a pie…"},
{ "name": "Was trying to come up with my own recipe for haggis, but I’m not sure what it entrails."},
{ "name": "The recipe said “place the stew in the oven at 180 degrees”. Now it’s poured all over the place."},
{ "name": "Following a recipe, says I need: apples, five cubed. 125 sounds like a lot of apples for a pie…"},
{ "name": "What do you you call a sleeping pea?  ....A resti-pea!"},
{ "name": "What can you always substitute for ice in recipe?.... Frozen Water"},
{ "name": "What are the most dangerous recipes?.... Ones that call for squashes and whipped cream."},
{ "name": "What do you call a fake noodle?...An impasta."},
{ "name": "What did the baby corn say to its mom?...Where’s my popcorn?"},
{ "name": "What does a nosey pepper do?...Gets jalapeno business."},
{ "name": "What’s orange and sounds like a parrot?...A carrot."},
{ "name": "How fast is milk?...It’s pasteurized before you know it."},
{ "name": "How do you make an apple turnover?...Push it downhill."},
{ "name": "Why did the skeleton go to the barbecue?...To get another rib."},
{ "name": "What did the pecan say to the walnut?...We’re friends because we’re both nuts."},
{ "name": "What did one blueberry say to the other blueberry?...If you weren’t so sweet, we wouldn’t be in this jam."}
]